#+TITLE: org-protocol / aka calling org from outside

[[https://orgmode.org/worg/org-contrib/org-protocol.html#orgef3bed8][org-protocol.el – Intercept calls from emacsclient to trigger custom actions]]

* Getting browsers to launch emaicsclient in for org-protocol:// URIs
#+BEGIN_SRC shell
cat > "${HOME}/.local/share/applications/org-protocol.desktop" << EOF
[Desktop Entry]
Name=org-protocol
Exec=emacsclient %u
Type=Application
Terminal=false
Categories=System;
MimeType=x-scheme-handler/org-protocol;
EOF
update-desktop-database ~/.local/share/applications/
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
#+end_EXAMPLE
